[
  {
    "request_type": "parse",
    "request_summary": "URL: https://okna-osnova.ru/",
    "response_summary": "Сайт компании 'Основа-Крым' предлагает широкий выбор пластиковых и алюминиевых окон с акцентом на акции и специальные пр"
  },
  {
    "request_type": "parse",
    "request_summary": "URL: https://www.oknadelux.com/",
    "response_summary": "Сайт предлагает конкурентоспособные пластиковые окна с длительным гарантийным обслуживанием и бесплатным выездом замерщи"
  },
  {
    "request_type": "text",
    "request_summary": "Почему купить пластиковые окна в Симферополе лучше у нас?\n\nМы — компания «Континент Окна» имеем опыт",
    "response_summary": "Компания 'Континент Окна' обладает значительными конкурентными преимуществами благодаря своему опыту, широкому ассортименту и высококвалифицированным специалистам. Однако им стоит уделить внимание прозрачности цен и улучшению послепродажного сервиса для дальнейшего укрепления позиций на рынке."
  },
  {
    "request_type": "image",
    "request_summary": "Изображение: Screenshot 2025-12-09 121341.png",
    "response_summary": "Страница предлагает пластиковые окна и двери с различными классами и ценами, ориентированная на потребителей в Симферопо"
  },
  {
    "request_type": "image",
    "request_summary": "Изображение: Screenshot 2025-12-09 121341.png",
    "response_summary": "Страница предлагает пластиковые окна и двери с различными вариантами и ценами. Продукты разделены на три класса: 'Контин"
  },
  {
    "request_type": "text",
    "request_summary": "Почему алюминиевые окна в Симферополе лучше заказать у нас?\n\nМы — компания «Континент Окна» имеем оп",
    "response_summary": "Компания 'Континент Окна' обладает значительным опытом и хорошей репутацией на рынке алюминиевых окон в Симферополе. Она предлагает широкий ассортимент продукции и высококачественные услуги, однако ей стоит улучшить прозрачность в вопросах цен и доставки, а также активно публиковать отзывы клиентов для повышения доверия и привлечения новых заказчиков."
  },
  {
    "request_type": "image",
    "request_summary": "Изображение: Screenshot 2025-12-09 121341.png",
    "response_summary": "Страница предлагает пластиковые окна и двери в Симферополе, разделенные на три класса: Классик, Премиум и ДеЛюкс. Каждый"
  },
  {
    "request_type": "image",
    "request_summary": "Изображение: Screenshot 2025-12-09 121342.png",
    "response_summary": "На сайте представлена информация о производителе окон и дверей, акциях и услугах. Основной акцент на скидках и оптовых ц"
  },
  {
    "request_type": "text",
    "request_summary": "Почему купить пластиковые окна в Симферополе лучше у нас?\n\nМы — компания «Континент Окна» имеем опыт",
    "response_summary": "Компания «Континент Окна» имеет значительные конкурентные преимущества благодаря долгому опыту работы, широкому ассортименту и высококвалифицированному персоналу. Однако, для повышения привлекательности предложений стоит улучшить прозрачность цен, информацию о послепродажном обслуживании и предоставить примеры успешных проектов."
  },
  {
    "request_type": "text",
    "request_summary": "Почему купить пластиковые окна в Симферополе лучше у нас?\n\nМы — компания «Континент Окна» имеем опыт",
    "response_summary": "Компания «Континент Окна» имеет сильные позиции на рынке пластиковых и алюминиевых окон благодаря долгому опыту, высококвалифицированным специалистам и автоматизации производственных процессов. Однако, для повышения конкурентоспособности стоит добавить больше информации о ценах, успешных проектах и дополнительных услугах."
  }
]